# balanced_diet_info = {
#     "main_title": "平衡膳食准则,核心推荐",
#     "contents": [
#         {
#             "title": "食物多样，合理搭配",
#             "text": "● 坚持谷类为主的平衡膳食模式。\n\n● 每天的膳食应包括谷薯类、蔬菜水果、畜禽鱼蛋奶和豆类食物。\n\n● 平均每天摄入12种以上食物，每周25种以上，合理搭配。\n\n● 每天摄入谷类食物200~300g，其中包含全谷物和杂豆类50~150g；薯类50~100g。"
#         },
#         {
#             "title": "吃动平衡，健康体重",
#             "text": "● 各年龄段人群都应天天进行身体活动，保持健康体重。\n\n● 食不过量，保持能量平衡。\n\n● 坚持日常身体活动，每周至少进行5天中等强度身体活动，累计150分钟以上；主动身体活动最好每天6000步。\n\n● 鼓励适当进行高强度有氧运动，加强抗阻运动，每周2~3天。\n\n● 减少久坐时间，每小时起来动一动。"
#         },
#         {
#             "title": "多吃蔬果、奶类、全谷、大豆",
#             "text": "● 蔬菜水果、全谷物和奶制品是平衡膳食的重要组成部分。\n\n● 餐餐有蔬菜，保证每天摄入不少于300g的新鲜蔬菜，深色蔬菜应占1/2。\n\n● 天天吃水果，保证每天摄入200~350g的新鲜水果，果汁不能代替鲜果。\n\n● 吃各种各样的奶制品，摄入量相当于每天300ml以上液态奶。\n\n● 经常吃全谷物、大豆制品，适量吃坚果。"
#         },
#         {
#             "title": "适量吃鱼、禽、蛋、瘦肉",
#             "text": "● 鱼、禽、蛋类和瘦肉摄入要适量，平均每天120~200g。\n\n● 每周最好吃鱼2次或300~500g，蛋类300~350g，畜禽肉300~500g。\n\n● 少吃深加工肉制品。\n\n● 鸡蛋营养丰富，吃鸡蛋不弃蛋黄。\n\n● 优先选择鱼，少吃肥肉、烟熏和腌制肉制品。"
#         },
#         {
#             "title": "少盐少油，控糖限酒",
#             "text": "● 培养清淡饮食习惯，少吃高盐和油炸食品。成年人每天摄入食盐不超过5g，烹调油25~30g。\n\n● 控制添加糖的摄入量，每天不超过50g，最好控制在25g以下。\n\n● 反式脂肪酸每天摄入量不超过2g。\n\n● 不喝或少喝含糖饮料。\n\n● 儿童青少年、孕妇、乳母以及慢性病患者不应饮酒。成年人如饮酒，一天饮用的酒精量不超过15g。"
#         },
#         {
#             "title": "规律进餐，足量饮水",
#             "text": "● 合理安排一日三餐，定时定量，不漏餐，每天吃早餐。\n\n● 规律进餐、饮食适度，不暴饮暴食、不偏食挑食、不过度节食。\n\n● 足量饮水，少量多次。在温和气候条件下，低身体活动水平成年男性每天喝水1700ml，成年女性每天喝水1500ml。\n\n● 推荐喝白水或茶水，少喝或不喝含糖饮料，不用饮料代替白水。"
#         },
#         {
#             "title": "会烹会选，会看标签",
#             "text": "● 在生命的各个阶段都应做好健康膳食规划。\n\n● 认识食物，选择新鲜的、营养素密度高的食物。\n\n● 学会阅读食品标签，合理选择预包装食品。\n\n● 学习烹饪、传承传统饮食，享受食物天然美味。\n\n● 在外就餐，不忘适量与平衡。"
#         },
#         {
#             "title": "公筷分餐，杜绝浪费",
#             "text": "● 选择新鲜卫生的食物，不食用野生动物。\n\n● 食物制备生熟分开，熟食二次加热要热透。\n\n● 讲究卫生，从分餐公筷做起。\n\n● 珍惜食物，按需备餐，提倡分餐不浪费。\n\n● 做可持续食物系统发展的践行者。"
#         }
#     ]
# }
balanced_diet_info = [
    {
        "id": 1,
        "title": "食物多样，合理搭配",
        "categories": 0,
        "imagepath": "/assets/img/sugg-1.jpg",
        "subtitle": "",
        "content": [
            {
                "primary": "坚持谷类为主的平衡膳食模式",
                "secondary": "每天的膳食应包括谷薯类、蔬菜水果、畜禽鱼蛋奶和豆类食物。"
            },
            {
                "primary": "平均每天摄入12种以上食物，每周25种以上，合理搭配",
                "secondary": ""
            },
            {
                "primary": "每天摄入谷类食物200~300g，其中包含全谷物和杂豆类50~150g；薯类50~100g",
                "secondary": ""
            }
        ]
    },
    {
        "id": 2,
        "title": "吃动平衡，健康体重",
        "categories": 0,
        "imagepath": "/assets/img/sugg-2.jpg",
        "subtitle": "",
        "content": [
            {
                "primary": "各年龄段人群都应天天进行身体活动，保持健康体重",
                "secondary": ""
            },
            {
                "primary": "食不过量，保持能量平衡",
                "secondary": ""
            },
            {
                "primary": "坚持日常身体活动，每周至少进行5天中等强度身体活动，累计150分钟以上；主动身体活动最好每天6000步",
                "secondary": ""
            },
            {
                "primary": "鼓励适当进行高强度有氧运动，加强抗阻运动，每周2~3天",
                "secondary": ""
            },
            {
                "primary": "减少久坐时间，每小时起来动一动",
                "secondary": ""
            }
        ]
    },
    {
        "id": 3,
        "title": "多吃蔬果、奶类、全谷、大豆",
        "categories": 0,
        "imagepath": "/assets/img/sugg-3.jpg",
        "subtitle": "",
        "content": [
            {
                "primary": "蔬菜水果、全谷物和奶制品是平衡膳食的重要组成部分",
                "secondary": ""
            },
            {
                "primary": "餐餐有蔬菜，保证每天摄入不少于300g的新鲜蔬菜，深色蔬菜应占1/2",
                "secondary": ""
            },
            {
                "primary": "天天吃水果，保证每天摄入200~350g的新鲜水果，果汁不能代替鲜果",
                "secondary": ""
            },
            {
                "primary": "吃各种各样的奶制品，摄入量相当于每天300ml以上液态奶",
                "secondary": ""
            },
            {
                "primary": "经常吃全谷物、大豆制品，适量吃坚果",
                "secondary": ""
            }
        ]
    },
    {
        "id": 4,
        "title": "适量吃鱼、禽、蛋、瘦肉",
        "categories": 0,
        "imagepath": "/assets/img/sugg-4.jpg",
        "subtitle": "",
        "content": [
            {
                "primary": "鱼、禽、蛋类和瘦肉摄入要适量，平均每天120~200g",
                "secondary": ""
            },
            {
                "primary": "每周最好吃鱼2次或300~500g，蛋类300~350g，畜禽肉300~500g",
                "secondary": ""
            },
            {
                "primary": "少吃深加工肉制品",
                "secondary": ""
            },
            {
                "primary": "鸡蛋营养丰富，吃鸡蛋不弃蛋黄",
                "secondary": ""
            },
            {
                "primary": "优先选择鱼，少吃肥肉、烟熏和腌制肉制品",
                "secondary": ""
            }
        ]
    },
    {
        "id": 5,
        "title": "少盐少油，控糖限酒",
        "categories": 1,
        "imagepath": "/assets/img/sugg-5.jpg",
        "subtitle": "",
        "content": [
            {
                "primary": "培养清淡饮食习惯，少吃高盐和油炸食品。成年人每天摄入食盐不超过5g，烹调油25~30g",
                "secondary": ""
            },
            {
                "primary": "控制添加糖的摄入量，每天不超过50g，最好控制在25g以下",
                "secondary": ""
            },
            {
                "primary": "反式脂肪酸每天摄入量不超过2g",
                "secondary": ""
            },
            {
                "primary": "不喝或少喝含糖饮料",
                "secondary": ""
            },
            {
                "primary": "儿童青少年、孕妇、乳母以及慢性病患者不应饮酒。成年人如饮酒，一天饮用的酒精量不超过15g",
                "secondary": ""
            }
        ]
    },
    {
        "id": 6,
        "title": "规律进餐，足量饮水",
        "categories": 1,
        "imagepath": "/assets/img/sugg-6.jpg",
        "subtitle": "",
        "content": [
            {
                "primary": "合理安排一日三餐，定时定量，不漏餐，每天吃早餐",
                "secondary": ""
            },
            {
                "primary": "规律进餐、饮食适度，不暴饮暴食、不偏食挑食、不过度节食",
                "secondary": ""
            },
            {
                "primary": "足量饮水，少量多次。在温和气候条件下，低身体活动水平成年男性每天喝水1700ml，成年女性每天喝水1500ml",
                "secondary": ""
            },
            {
                "primary": "推荐喝白水或茶水，少喝或不喝含糖饮料，不用饮料代替白水",
                "secondary": ""
            }
        ]
    },
    {
        "id": 7,
        "title": "会烹会选，会看标签",
        "categories": 1,
        "imagepath": "/assets/img/sugg-7.jpg",
        "subtitle": "",
        "content": [
            {
                "primary": "在生命的各个阶段都应做好健康膳食规划",
                "secondary": ""
            },
            {
                "primary": "认识食物，选择新鲜的、营养素密度高的食物",
                "secondary": ""
            },
            {
                "primary": "学会阅读食品标签，合理选择预包装食品",
                "secondary": ""
            },
            {
                "primary": "学习烹饪、传承传统饮食，享受食物天然美味",
                "secondary": ""
            },
            {
                "primary": "在外就餐，不忘适量与平衡",
                "secondary": ""
            }
        ]
    },
    {
        "id": 8,
        "title": "公筷分餐，杜绝浪费",
        "categories": 1,
        "imagepath": "/assets/img/sugg-8.jpg",
        "subtitle": "",
        "content": [
            {
                "primary": "选择新鲜卫生的食物，不食用野生动物",
                "secondary": ""
            },
            {
                "primary": "食物制备生熟分开，熟食二次加热要热透",
                "secondary": ""
            },
            {
                "primary": "讲究卫生，从分餐公筷做起",
                "secondary": ""
            },
            {
                "primary": "珍惜食物，按需备餐，提倡分餐不浪费",
                "secondary": ""
            },
            {
                "primary": "做可持续食物系统发展的践行者",
                "secondary": ""
            }
        ]
    },
    {
        "id": 1,
        "title": "饮食建议,健康习惯",
        "categories": 0,
        "imagepath": "/assets/img/sugg-1.jpg",
        "subtitle": "适时地吃一些健康零食",
        "content": [
            {
                "primary": "",
                "secondary": "每隔一段时间可以吃点东西，以保证血糖保持在相对较高的水平，但又不至于飙升。例如，每三个小时左右吃一块水果，可以防止饥饿和卡路里的过度消耗。当你吃饭的时候，要学会放松，尽量不要考虑研究的事儿；如果经常站在实验室里，请坐下；如果你经常久坐不动，要多起身走一走——比如，去见见楼下的同事。"
            }
        ]
    },
    {
        "id": 2,
        "title": "饮食建议,健康习惯",
        "categories": 0,
        "imagepath": "/assets/img/sugg-1.jpg",
        "subtitle": "适时地吃一些健康零食",
        "content": [
            {
                "primary": "将三餐添加到你的日程中",
                "secondary": "把用餐时间也安排进你的日程中——因为如果你不这样做，其他人可能会“插空”，比如邀请你参加会议。选择一个与“生物钟”和激素（如胰岛素）变化相一致的时段，以优化新陈代谢健康，包括微生物组的多样性和组成。换句话说，相信你的直觉，在一天中你觉得身体需要的时候吃东西，但通常来说，尽量避免太晚吃午饭。早点吃可以改善你的能量平衡、体重调节、血糖控制和睡眠满意度。"
            }
        ]
    },
    {
        "id": 3,
        "title": "饮食建议,健康习惯",
        "categories": 0,
        "imagepath": "/assets/img/sugg-1.jpg",
        "subtitle": "适时地吃一些健康零食",
        "content": [
            {
                "primary": "注意休息",
                "secondary": "大脑消耗能量约占身体总能量的 20%，因此保持一致的能量水平对于保持机体最佳功能非常重要。按照计划的时间，专注于你吃的东西，慢慢来，也不要在屏幕前抓起三明治狼吞虎咽来“搪塞”自己。你的身体理应得到休息。"
            }
        ]
    },
    {
        "id": 4,
        "title": "饮食建议,健康习惯",
        "categories": 0,
        "imagepath": "/assets/img/sugg-1.jpg",
        "subtitle": "适时地吃一些健康零食",
        "content": [
            {
                "primary": "尽量提前安排好你的饮食",
                "secondary": "增加低热量食物的摄入量，例如汤、沙拉、蔬菜和富含膳食纤维的微加工食品，还包括全谷物、谷物、水果、豆类、全米和全麦面食。这些食物富含微量营养素和抗氧化剂，如钾、镁、维生素C、维生素E、B族维生素和健康，尤其是不饱和omega - 3 ，有助于预防慢性疾病。5 - 羟色胺、多巴胺、肾上腺素和去甲肾上腺素等神经递质，对大脑功能、情绪和情绪调节都很重要，而机体需要食物衍生的前体以及维生素和矿物质才能合成这些物质。"
            }
        ]
    },
    {
        "id": 5,
        "title": "饮食建议,健康习惯",
        "categories": 0,
        "imagepath": "/assets/img/sugg-1.jpg",
        "subtitle": "适时地吃一些健康零食",
        "content": [
            {
                "primary": "让你的饮食丰富起来",
                "secondary": "通过丰富食物选择来刺激你的食欲，最好是在饮食中加入更多的水果和蔬菜，并减少红肉和肉制品的摄入。每一天都应该有新的用餐体验。但这并不意味着要成为一个美食鉴赏家：过度考虑吃的东西会占用你的时间，并且会让你做出妥协——选择那些更诱人的食物。日本冲绳群岛——世界上慢性病发病率最低的地区之一、许多百岁老人居住的地方，有一句谚语：“吃到八分饱”。也就是说，这意味着你应该停下来的时候不要再吃了，以免过度饱腹。这对身体有好处，也有助于延长寿命。"
            }
        ]
    }, {
      "id": 1,
      "title": "多吃蔬菜",
      "categories": 2,
      "imagepath": "/assets/img/sugg-2.jpg",
      "subtitle": "儿童青少年人群",
      "content": [
        {
          "primary": "营养需求",
          "secondary":
            "蔬菜富含维生素、矿物质和纤维，有助于儿童和青少年的生长发育。",
        },
        {
          "primary": "健康习惯",
          "secondary": "培养健康饮食习惯，对未来的健康至关重要。",
        },
      ],
    },
    {
      "id": 2,
      "title": "多喝热水",
      "categories": 2,
      "imagepath": "/assets/img/sugg-1.jpg",
      "subtitle": "消化不良人群",
      "content": [
        {
          "primary": "促进消化",
          "secondary":
            "热水可以促进胃肠蠕动，有助于消化食物，减少消化不良和便秘的发生。",
        },
        {
          "primary": "促进新陈代谢",
          "secondary":
            "喝热水可以增加体温，促进新陈代谢，有助于身体健康和保持体重。",
        },
        {
          "primary": "放松肌肉",
          "secondary":
            "热水可以缓解肌肉紧张和疼痛，有助于放松身体，缓解压力和疲劳。",
        },
      ],
    },
    {
      "id": 3,
      "title": "多睡觉",
      "categories": 2,
      "imagepath": "/assets/img/img.png",
      "subtitle": "精神压力人群",
      "content": [
        {
          "primary": "压力缓解",
          "secondary":
            " 充足的睡眠可以帮助降低身体内的应激激素水平，如皮质醇，从而减轻精神压力和焦虑。",
        },
        {
          "primary": "情绪稳定",
          "secondary":
            "良好的睡眠有助于维持情绪的稳定，降低情绪波动和易怒情绪的发生，从而更好地应对压力。",
        },
        {
          "primary": "思维清晰",
          "secondary":
            "充足的睡眠可以改善大脑功能，使思维更加清晰，提高集中力和注意力，有助于更好地处理压力情况。",
        },
      ],
    },


]
